export const categories: any[] = [
  {
    name: "სანაოსნო სპორტი",
    icon: "sailing",
    subcategories: [
      {
        name: "პადლბორდინგი",
        items: ["გასმარული", "ჟუნკა", "კუნრანდი", "ქალანური"],
      },
      {
        name: "ფლაიბორდი",
        items: ["ქუდი", "კანტალი", "ყურძენი"],
      },
    ],
  },
  {
    name: "ზამთრის სპორტი",
    icon: "downhill_skiing",
    subcategories: [
      {
        name: "თხილამური",
        items: [
          "თხილამურები",
          "საკინძეები",
          "ჩექმები",
          "ჩექმების ჩანთები",
          "თხილამურების ჩანთები",
          "თხილამურის ჯოხები",
          "შარვლები",
          "ქურთუკები",
          "ხელთათმანები",
          "ჩაფხუტები",
          "სათვალეები",
          "დამცავები",
          "ზურგჩანთები",
          "თერმული ტანსაცმელი",
        ],
      },
      {
        name: "სნოუბორდი",
        items: [
          "სნოუბორდები",
          "საკინძეები",
          "ჩექმები",
          "ჩექმების ჩანთები",
          "სპლიტბორდები",
          "სნოუბორდის ჩანთები",
          "შარვლები",
          "ქურთუკები",
          "ხელთათმანები",
          "ჩაფხუტები",
          "სათვალეები",
          "ზურგჩანთები",
        ],
      },
      {
        name: "ალპინიზმი",
        items: ["ჩაფხუტი", "ტრუხა", "მანადი"],
      },
    ],
  },
  {
    name: "ლაშქრობა & კემპინგი",
    icon: "camping",
    subcategories: [
      { name: "ზურგჩანთები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "სალაშქრო აღჭურვილობა",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      { name: "კარვები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "საძილე აღჭურვილობა",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      { name: "ჰამაკები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "სანათები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "პარალონები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "ინვენტარი & აქსესუარები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
    ],
  },
  {
    name: "ველოსპორტი",
    icon: "directions_bike",
    subcategories: [
      {
        name: "ელექტრო ველოსიპედები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      {
        name: "ჰიბრიდული ველოსიპედები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      {
        name: "სამთო ველოსიპედები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      {
        name: "საგზაო ველოსიპედები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      {
        name: "მსხვილბორბლიანი ველოსიპედები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      { name: "BMX", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "უგზოობის მოტოციკლი",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
    ],
  },
  {
    name: "ურბანული სპორტი",
    icon: "skateboarding",
    subcategories: [
      { name: "სკეიტბორდერბი", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "ლონგბორდები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "ჰოვერბორდები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "პენიბორდები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "ელექტრო სკუტერები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      { name: "სკუტერები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "დამცავი აქსესუარები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
    ],
  },
  {
    name: "თევზაობა",
    icon: "phishing",
    subcategories: [
      { name: "ანკესები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "სათევზაო ბადეები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
      { name: "კომბინიზონები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "ჩექმები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      { name: "სათევზაო ნავები", items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"] },
      {
        name: "სამაშველო ჟილეტები",
        items: ["ბორნასი", "ჭალაკაჭი", "კუნრანდი"],
      },
    ],
  },
  {
    name: "ინვენტარი & აქსესუარები",
    icon: "backpack",
    subcategories: [
      {
        name: "აუცილებელი ნივთები",
        items: ["კომპასი", "ფანარი", "ელემენტები & ბატარეები"],
      },
    ],
  },
]
