import {EFAQCategory, IFAQ, IFAQCards, IFAQItem} from "../ts/components/faq.types.ts"

export const FAQCards: IFAQCards[] = [
    {
        icon: "account_circle",
        title: "მომხმარებელი",
        description: "ყველანაირი კითხვა მომხმარებლის შექმნიდან შეძენამდე.",
        name: EFAQCategory.CLIENT,
    },
    {
        icon: "storefront",
        title: "გამქირავებელი",
        description: "ყველანაირი კითხვა პროდუქციის გაყიდვის შესახებ.",
        name: EFAQCategory.RETAILER,
    },
    {
        icon: "shield_person",
        title: "ადმინისტრაცია",
        description: "ყველანაირი კითხვა ადმინისტრირების შესახებ.",
        name: EFAQCategory.ADMIN,
    },
]

export const FAQItems: IFAQItem[] = [
    {
        value: "item-1",
        title: "როგორ ხდება ნივთის ქირაობა?",
        icon: "shopping_bag",
        content:
            "მომთაბარეზე რეგისტრაციას სულ რამდენიმე წუთში, ამ ბმულზე პირადი ინფორმაციის შეყვანით და საბანკო ბარათის დამატებით შეძლებ.",
    },
    {
        value: "item-2",
        title: "სად შეიძლება აღჭურვილობის აღება?",
        icon: "flag_2",
        content:
            "მომთაბარეზე აღჭურვილობის ქირაობა ძალიან მარტივია. რეგისტრაციის შემდეგ ვებგვერდის კატალოგიდან სასურველი ნივთების დამატებას პირდაპირ ზურგჩანთაში შეძლებ, ონლაინ გადახდის შემდეგ კი ჯავშნის დასტურს ელექტრონული ფოსტის საშუალებით მიიღებ.",
    },
    {
        value: "item-3",
        title: "შემიძლია თუ არა შევცვალო შეკვეთა?",
        icon: "question_exchange",
        content:
            "ნივთის დაჯავშნის შემდეგ ელექტრონული ფოსტის საშუალებით ჯავშნის დამადასტურებელ შეტყობინებას მიიღებ, რომელზეც გარდა შეკვეთის ნომრისა, მითითებული იქნება ვენდორის მისამართი და ტელეფონის ნომერი.",
    },
    {
        value: "item-4",
        title: "როგორ დავრეგისტრირდე?",
        icon: "account_circle",
        content: "დააჭირეთ პროფილის ღილაკს, და გაყევით დიალოგში ნაჩვენებ ინსტრუქციას.",
    },
    {
        value: "item-5",
        title: "როგორ დავუკავშირდე გამქირავებელს?",
        icon: "phone_in_talk",
        content: "გამქირავებელთან დაკავშირება შესაძლებელია პირადი ტელეფონის ნომრითა და ელ.ფოსტით.",
    },
]


export const FAQClients: IFAQ[] = [
    {
        value: "q1",
        question: "როგორ დავრეგისტრირდე?",
        answer:
            "მომთაბარეზე რეგისტრაციას სულ რამდენიმე წუთში, ამ ბმულზე პირადი ინფორმაციის შეყვანით და საბანკო ბარათის დამატებით შეძლებ.",
    },
    {
        value: "q2",
        question: "როგორ ვიქირაო აღჭურვილობა?",
        answer:
            "\n" +
            "მომთაბარეზე აღჭურვილობის ქირაობა ძალიან მარტივია. რეგისტრაციის შემდეგ ვებგვერდის კატალოგიდან სასურველი ნივთების დამატებას პირდაპირ ზურგჩანთაში შეძლებ, ონლაინ გადახდის შემდეგ კი ჯავშნის დასტურს ელექტრონული ფოსტის საშუალებით მიიღებ.\n" +
            "\n",
    },
    {
        value: "q3",
        question: "როგორ ავიღო დაჯავშნილი აღჭურვილობა?",
        answer:
            "\n" +
            "ნივთის დაჯავშნის შემდეგ ელექტრონული ფოსტის საშუალებით ჯავშნის დამადასტურებელ შეტყობინებას მიიღებ, რომელზეც გარდა შეკვეთის ნომრისა, მითითებული იქნება ვენდორის მისამართი და ტელეფონის ნომერი.",
    },
    {
        value: "q4",
        question: "როგორ შევცვალო/გავაუქმო შეკვეთა?",
        answer: "ძალიან მარტივად",
    },
]

export const FAQRetailers: IFAQ[] = [
    {
        value: "q1",
        question: "როგორ დავრეგისტირდე რიტეილერის პორტალზე?",
        answer:
            "რიტეილერის რეგისტრაცია მარტივია – გადადით ანგარიშის გვერდზე და მოითხოვეთ რეგისტრაცია. თქვენი ინფორმაცია სწრაფად გადამოწმდება და ანგარიში აქტიურდება.",
    },
    {
        value: "q2",
        question: "როგორ დავამატო პროდუქტი/აღჭურვილობა?",
        answer:
            "პროდუქტის დამატება ხელმისაწვდომია 'პროდუქტის დამატება' მენიუში. შეავსეთ აუცილებელი ველები, ატვირთეთ სურათები და პროდუქტი დროულად გამოჩნდება.",
    },
    {
        value: "q3",
        question: "როგორ ვმართო შეკვეთები?",
        answer:
            "შეკვეთების მართვა ხდება პანელის 'შეკვეთები' განყოფილებაში, სადაც შეგიძლიათ გადახედოთ შეკვეთების სტატუსს და განახორციელოთ საჭირო ცვლილებები.",
    },
    {
        value: "q4",
        question: "როგორ განახლდეს მარაგი?",
        answer:
            "ინვენტარის განახლება მარტივია – რიტეილერის პანელში შეიყვანეთ ახალი რაოდენობა თითოეულ პროდუქტის დეტალებში და მ_system_ ავტომატურად განაახლდება.",
    },
];

export const FAQAdmin: IFAQ[] = [
    {
        value: "q1",
        question: "როგორ შევიდე ადმინ პანელში?",
        answer:
            "ადმინ პანელში შესვლა შესაძლებელია მომხმარებლის გვერდიდან, რაც უზრუნველყოფს უსაფრთხო ადმინისტრირების მუშაობას.",
    },
    {
        value: "q2",
        question: "როგორ ვმართო მომხმარებლები?",
        answer:
            "მომხმარებლების მართვა განხორციელდება 'მომხმარებლების მართვა' განყოფილებაში, სადაც შეგიძლიათ დააკვირდეთ რეგისტრაციებს, აქტივობებს და სრულყოჩეთ საჭირო ცვლილებები.",
    },
    {
        value: "q3",
        question: "როგორ დამტკიცდეს რიტეილერის ანგარიშები?",
        answer:
            "რიტეილერის რეგისტრაციები ტოვებულია დამტკიცების მოლოდინში. შესვლით შესაბამის მენიუში, შეგიძლიათ დამტკიცოთ ან უარყოფოთ ახალი ანგარიშები.",
    },
    {
        value: "q4",
        question: "როგორ ვაკონტროლო ანგარიშები?",
        answer:
            "ანგარიშების კონტროლის მენიუ ხელმისაწვდომია ადმინ პანელში. აირჩიეთ სასურველი პერიოდი და მიიღეთ დეტალური სტატისტიკა სისტემიდან.",
    },
];
